---
kind: method
id: M:Autodesk.Revit.DB.TessellatedFace.GetBoundaryLoops
source: html/4baac8a2-c2c9-d1a3-3e68-d873b5fa5407.htm
---
# Autodesk.Revit.DB.TessellatedFace.GetBoundaryLoops Method

Get loops bounding the face.

## Syntax (C#)
```csharp
public IList<IList<XYZ>> GetBoundaryLoops()
```